Naptick/Naphome_Firmware/config/sdkconfig.defaults
# Naphome Phase 0.9 Firmware Configuration Defaults

# Target chip
CONFIG_IDF_TARGET="esp32s3"

# Component config
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10

# I2C Configuration
CONFIG_I2C_ENABLE_DEBUG_LOG=n

# WiFi Configuration
CONFIG_ESP32_WIFI_STATIC_RX_BUFFER_NUM=10
CONFIG_ESP32_WIFI_DYNAMIC_RX_BUFFER_NUM=32

# FreeRTOS
CONFIG_FREERTOS_HZ=1000

# Logging
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL_VERBOSE=y

# Sensor Manager - Publish sensor data every 2 seconds for app monitoring
CONFIG_SENSOR_MANAGER_PUBLISH_INTERVAL_MS=2000
